// ---------------------------------------------------------------------
// Списки регистров
// ---------------------------------------------------------------------

// Сегментные регистры
reg [15:0]  seg_cs = 16'hF000;
reg [15:0]  seg_ss = 16'h0000;
reg [15:0]  seg_es = 16'h0000;
reg [15:0]  seg_ds = 16'h0000;
reg [15:0]  seg_ea = 0;

// Регистры
reg [15:0]  ax = 16'h1255;
reg [15:0]  bx = 16'h2342;
reg [15:0]  cx = 16'h3344;
reg [15:0]  dx = 16'h6677;
reg [15:0]  sp = 16'h1234;
reg [15:0]  bp = 16'h5678;
reg [15:0]  si = 16'h9ABD;
reg [15:0]  di = 16'hEF01;
reg [15:0]  ea = 0;
reg [15:0]  ip = 0;
reg [11:0]  flags = 0;

// Выбранная шина адреса (sel=1) seg:ea (sel=0) cs:ip
reg         sel = 0;
reg         sel_seg = 0;
reg  [1:0]  sel_rep = 0;

// ---------------------------------------------------------------------
// Состояние процессора
// ---------------------------------------------------------------------

reg [1:0]   main = 0;
reg [3:0]   tstate = 0;
reg [3:0]   estate = 0;
reg [7:0]   opcode = 0;
reg [7:0]   modrm = 0;
reg         isize = 0;   // 8|16
reg         idir  = 0;   // rm,r | r,rm
reg [ 3:0]  alumode = 0;
reg [15:0]  op1;
reg [15:0]  op2;
reg [15:0]  wb;          // Для записи в reg/rm

// ---------------------------------------------------------------------
// Константы и initial
// ---------------------------------------------------------------------

localparam

    PREPARE = 0,        // Эта подготовки инструкции к исполнению
    MAIN    = 1,        // Обработка микрокода
    FETCHEA = 2,        // Считывание ModRM/EA
    SETEA   = 3;        // Запись в память или регистр

initial data = 8'hFF;
initial wreq = 0;

// ---------------------------------------------------------------------
// Модули
// ---------------------------------------------------------------------

wire [15:0] result;
wire [11:0] flags_o;

alu UnitALU
(
    // Входящие данные
    .isize      (isize),
    .alumode    (alumode),
    .op1        (op1),
    .op2        (op2),
    .flags      (flags),

    // Исходящие данные
    .result     (result),
    .flags_o    (flags_o)
);

